Repository: pingfangx/TranslatorX-other
Catalog: AndroidGuide/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: For more information, see the API reference for AnimatedVectorDrawable.
zh_cn: 有关详细信息，请参阅 AnimatedVectorDrawable 的 API 参考。

source: For the velocity value, you can use the value computed for you by GestureDetector.
zh_cn: 对于速度值，你可以使用 GestureDetector 为你计算的值。

source: For this reason, using resource intensive animations can negatively impact the performance of your app.
zh_cn: 因此，使用资源密集型动画可能会对应用程序的性能产生负面影响。

source: For this reason, you should not start long running background threads from a broadcast receiver.
zh_cn: 因此，不应该从广播接收器开始长时间运行后台线程。

source: For this sample, overriding the onDraw() method allows us to paint the blue lines on the EditText view canvas (the canvas is passed into the overridden onDraw() method).
zh_cn: 对于此示例，重写 onDraw() 方法允许我们在 EditText 视图画布上绘制蓝线（画布将传递到重写的 onDraw() 方法）。

source: Forgetting these method calls can cause hard-to-find bugs.
zh_cn: 忘记这些方法调用可能会导致难以发现的错误。

source: Fortunately, Android provides helper classes to simulate this and other behaviors.
zh_cn: 幸运的是，Android 提供了帮助类来模拟这个和其他行为。

source: Fortunately, you can easily create components that look and behave in any way you like, limited perhaps only by your imagination, the size of the screen, and the available processing power (remember that ultimately your application might have to run on something with significantly less power than your desktop workstation).
zh_cn: 幸运的是，你可以很轻松的创建一个任意样式、任意行为的组件，只要你喜欢。所受的限制可能仅仅是你的想象力、屏幕的大小以及可用的处理能力(记住最终你的应用要运行在一个很多性能都比你的电脑要差的系统上)。

source: Frame animation
zh_cn: 帧动画

source: Frame refresh delay: You can specify how often to refresh frames of your animation.
zh_cn: 帧刷新延迟：可以指定刷新动画帧的频率。

source: Fully Customized Components
zh_cn: 完整的自定义组件

source: Fully customized components can be used to create graphical components that appear however you wish.
zh_cn: 完整的自定义组件可以用来创建一个图形组件，它可以按你想的任意呈现。

source: Furthermore, nesting several instances of LinearLayout that use the layout_weight parameter can be especially expensive as each child needs to be measured twice.
zh_cn: 此外，嵌套使用 layout_weight 参数的 LinearLayout 的多个实例可能特别昂贵，因为每个子对象都需要测量两次。

source: Furthermore, this is not a default constructor, but a parameterized one.
zh_cn: 此外，这不是一个默认的，而是一个带着参数的构造方法。

source: Generally speaking, broadcasts can be used as a messaging system across apps and outside of the normal user flow.
zh_cn: 一般来说，广播可以用作跨应用程序和正常用户流之外的消息传递系统。

source: Generally, at this point, the device has reached a memory paging state, so this action is required in order to keep the user interface responsive.
zh_cn: 通常，此时设备已达到内存分页状态，因此需要执行此操作以保持用户界面响应。

source: Gestures are a powerful way to control touchscreen devices, but they can be counterintuitive and difficult to remember unless they produce physically plausible results.
zh_cn: 手势是控制触摸屏设备的有效方式，但它们可能违反直觉并且难以记住，除非它们产生物理上可信的结果。

source: Getting started
zh_cn: 入门

source: Handle Input Gestures
zh_cn: 处理输入手势

source: Handle Layout Events
zh_cn: 处理布局事件

source: Hardware Abstraction Layer (HAL)
zh_cn: 硬件抽象层(HAL)

source: Here are a few other things to consider when using chains:
zh_cn: 在使用链条时，还需要考虑以下几点：

source: Here are some security considerations and best practices for sending and receiving broadcasts:
zh_cn: 以下是发送和接收广播时的一些安全注意事项和最佳做法：

source: Here are some things to note in this file:
zh_cn: 以下是此文件中需要注意的事项：

source: Here is a high level overview of what you need to know to get started in creating your own View components:
zh_cn: 这里是有关如何开始创建自己的 View 组件的高度概括：

source: Here is the resulting AnimatedVectorDrawable:
zh_cn: 下面是结果 AnimatedVectorDrawable：

source: Here's a full example MotionLayout file that can be used to create the motion in figure 1:
zh_cn: 下面是一个完整的 MotionLayout 示例，可以用来创建图 1 中的运动：

source: Here's a snippet from PieChart.onSizeChanged() that shows how to do this:
zh_cn: 以下是来自 PieChart.onSizeChanged() 的片段，其中显示了如何执行此操作：

source: Here's a summary of some of the other standard methods that the framework calls on views:
zh_cn: 这里有一些框架在 view 中调用的标准的方法的摘要：

source: Here's an example Activity, in which the animation is added to an ImageView and then animated when the screen is touched:
zh_cn: 下面是一个例子 Activity，其中，所述动画被添加到 ImageView 然后当屏幕被触摸进行动画：

source: Here's an example MotionScene file that describes the basic horizontal motion in figure 1:
zh_cn: 下面是一个示例 MotionScene 文件，它描述了图 1 中的基本水平运动：

source: Here's an example XML file for a Drawable animation:
zh_cn: 以下是 Drawable 动画的 XML 文件示例：

source: Here's an example implementation of onMeasure().
zh_cn: 这是 onMeasure() 的示例实现。

source: Here's an example of an attrs.xml file:
zh_cn: 以下是 attrs.xml 文件的示例：

source: Here's how the PieChart class reads its attributes:
zh_cn: 以下是 PieChart 类如何读取其属性：

source: Here's how you can apply one of these with the android:interpolator attribute:
zh_cn: 这里是你如何运用这些与一个 android:interpolator 属性：

source: Here's the layout file:
zh_cn: 这是布局文件：

source: Hierarchy Viewer works by allowing you to select running processes on a connected device or emulator, then display the layout tree.
zh_cn: 层次结构查看器允许你选择连接的设备或模拟器上正在运行的进程，然后显示布局树。

source: Horizontally, the endpoints are at the far left and right sides of the screen.
zh_cn: 在水平方向上，端点位于屏幕的最左侧和最右侧。

source: How an animation behaves when it reaches the end of the animation.
zh_cn: 动画到达动画结尾时的行为方式。

source: How animations are calculated
zh_cn: 动画是如何计算

source: How many times to repeat an animation.
zh_cn: 一个动画要重复多少次。

source: How property animation differs from view animation
zh_cn: 属性动画与视图动画的区别

source: How property animation works
zh_cn: 属性动画的工作原理

source: However, clipping will occur if the animation exceeds the bounds of the parent View.
zh_cn: 但是，如果动画超出父视图的边界，则将发生剪裁。

source: However, each widget and layout you add to your application requires initialization, layout, and drawing.
zh_cn: 但是，添加到应用程序中的每个小部件和布局都需要初始化、布局和绘图。

source: However, even with this approach the system expects you to finish with the broadcast very quickly (under 10 seconds).
zh_cn: 然而，即使采用这种方法，系统也希望你能够非常快地完成广播(不到 10 秒)。

source: However, if the given dimension has only one constraint, then the view expands to fit its contents.
zh_cn: 但是，如果给定尺寸只有一个约束，则 view 将扩展以适合其内容。

source: However, if you want to override layout attributes using the <include> tag, you must override both android:layout_height and android:layout_width in order for other layout attributes to take effect.
zh_cn: 但是，如果要使用 <include> 标签覆盖布局属性，则必须同时覆盖 android:layout_height 和 android:layout_width 才能使其他布局属性生效。

source: However, once your code returns from onReceive(), the BroadcastReceiver is no longer active.
zh_cn: 但是，一旦代码从 onReceive() 返回，广播接收器将不再处于活动状态。

source: However, simulating the feel of a flywheel isn't trivial.
zh_cn: 然而，模拟飞轮的感觉并非无足轻重。

source: However, this is only to make editing easier; if a view has no constraints when you run your layout on a device, it is drawn at position [0,0] (the top-left corner).
zh_cn: 然而这个仅仅是让编辑的时候更容易而已，如果这个 View 没有任何约束，当你运行应用到在设备上，他将会被绘制到左上角[0,0]这个位置。

source: However, using another LinearLayout as the root for the re-usable layout would result in a vertical LinearLayout inside a vertical LinearLayout.
zh_cn: 然而，使用另一个 LinearLayout 作为可重复使用的布局的根将导致垂直 LinearLayout 内嵌垂直的 LinearLayout。

source: However, you can modify that behavior with the following attributes and values (these attributes take effect only when you set the view width to match constraints):
zh_cn: 但是，可以使用以下属性和值修改该行为(这些属性仅在将视图宽度设置为匹配约束时生效)：

source: However, you can still override them if you need to.
zh_cn: 当然，如果需要你也可以重写。

source: However, you can toggle between spread, spread inside, and packed by selecting any view in the chain and then clicking the chain button that appears below the view.
zh_cn: 但是，你可以在 spread、spread inside 和 packed 之间切换，方法是选择链中的任何视图，然后单击出现在视图下方的链按钮 。

source: However, you must be careful not to abuse the opportunity to respond to broadcasts and run jobs in the background that can contribute to a slow system performance, as described in the following video.
zh_cn: 但是，你必须小心，不要滥用在后台响应广播和运行作业的机会，这可能会导致系统性能降低，如以下视频中所述。

source: However, you sometimes want to use ValueAnimator directly because ObjectAnimator has a few more restrictions, such as requiring specific accessor methods to be present on the target object.
zh_cn: 但是，有时你希望直接使用 ValueAnimator ，因为 ObjectAnimator 还有一些限制，比如要求目标对象上存在特定的访问器方法。

source: If both the width and height are set to match constraints, you can click Toggle Aspect Ratio Constraint to select which dimension is based on a ratio of the other.
zh_cn: 如果宽度和高度都设置为 match constraints，你可以单击 Toggle Aspect Ratio Constraint 来选择哪个尺寸基于另一个比率。

source: If enabled, when you add child views to a parent, this feature automatically creates two or more constraints for each view as you add them to the layout, but only when it's appropriate to constrain the view to the parent layout.
zh_cn: 如果启用，将子视图添加到父视图时，此功能会在将每个视图添加到布局时自动为其创建两个或多个约束，但仅当将视图约束到父布局时才适用。

source: If implemented poorly, your layout can lead to a memory hungry application with slow UIs.
zh_cn: 如果实现得不好，你的布局可能会导致一个内存不足、UI 速度慢的应用程序。

source: If it finds conflicting measurements, it may need to traverse the hierarchy multiple times.
zh_cn: 如果发现有冲突的测量，则可能需要多次遍历层次结构。

source: If it has a background image, the background image will be transformed along with the text.
zh_cn: 如果它有背景图像，背景图像将与文本一起转换。

source: If it is set false then the animation will loop.
zh_cn: 如果设置为 false 则动画将循环。

source: If many apps have registered to receive the same broadcast in their manifest, it can cause the system to launch a lot of apps, causing a substantial impact on both device performance and user experience.
zh_cn: 如果许多应用程序在其清单中注册接收相同的广播，则可能导致系统启动许多应用程序，从而对设备性能和用户体验造成实质性影响。

source: If none of the prebuilt widgets or layouts meets your needs, you can create your own View subclass.
zh_cn: 如果预制的组件和布局都不能满足你的需求，你可以创建自己的 View 子类。

source: If none of the provided interpolators suits your needs, implement the TimeInterpolator interface and create your own.
zh_cn: 如果提供的插值程序都不适合你的需要，请实现 TimeInterpolator 接口并创建自己的插值器。

source: If not specified, the animation starts at the value obtained by the property's get method.
zh_cn: 如果没有指定，动画开始于由属性的 get 方法得到的值。

source: If that process hosts only a manifest-declared receiver (a common case for apps that the user has never or not recently interacted with), then upon returning from onReceive(), the system considers its process to be a low-priority process and may kill it to make resources available for other more important processes.
zh_cn: 如果该进程仅承载清单声明的接收器(这是用户从未或最近没有与之交互的应用程序的常见情况)，那么当从 onReceive() 返回时，系统会将其进程视为低优先级进程，并可能会终止该进程，以便为其他更重要的进程提供资源。

source: If the target value changes, you need to cancel the animation at the time of target value change, re-configure the animation with a new value as the new start value, and add the new target value.
zh_cn: 如果目标值更改，则需要在目标值更改时取消动画，使用新值作为新的开始值重新配置动画，然后添加新的目标值。

source: If the value you want to change is one of the base View properties, doing the animation is even easier, because Views have a built-in ViewPropertyAnimator that is optimized for simultaneous animation of multiple properties.
zh_cn: 如果要更改的值是基本 View 属性之一，则执行动画会更加容易，因为 view 具有内置的 ViewPropertyAnimator，针对多个属性的同步动画进行了优化。

source: If there is a component that is already very similar to what you want, you can simply extend that component and just override the behavior that you want to change.
zh_cn: 如果有一个组件已经非常接近你想要的组件，你可以简单的继承那个组件并且重写你想要改变的行为。

source: If view animation accomplishes everything that you need to do, or if your existing code already works the way you want, there is no need to use the property animation system.
zh_cn: 如果视图动画完成了所有需要做的事情，或者如果现有代码已经按你想要的方式工作，则不需要使用属性动画系统。

source: If you add opposing constraints on a view, the constraint lines become squiggly like a spring to indicate the opposing forces, as shown in video 2.
zh_cn: 如果在 view 上添加了相反的约束，约束线会变成像弹簧一样扭曲来表示相反的力，就像视频 2。

source: If you already know the layout that you want to re-use, create a new XML file and define the layout.
zh_cn: 如果你已经知道要重用的布局，请创建一个新的 XML 文件并定义布局。

source: If you are animating an object property that is not an int, float, or color, you must implement the TypeEvaluator interface to specify how to compute the object property's animated values.
zh_cn: 如果要为 不是int、float 或 color 的对象属性设置动画，则必须实现 TypeEvaluator 接口，以指定如何计算对象属性的动画值。

source: If you are developing an app that requires C or C++ code, you can use the Android NDK to access some of these native platform libraries directly from your native code.
zh_cn: 如果你正在开发一个需要 C 或 C++ 代码的应用程序，你可以使用 Android NDK 直接从原生代码访问这些 原生平台库。

source: If you aren't using AndroidX, add the following support library dependency:
zh_cn: 如果不使用 AndroidX，请添加以下支持库依赖项：

source: If you declare a broadcast receiver in your manifest, the system launches your app (if the app is not already running) when the broadcast is sent.
zh_cn: 如果在清单中声明广播接收器，则在发送广播时，系统将启动应用程序(如果应用程序尚未运行)。

source: If you don't apply any attributes, then your interpolator will function exactly the same as those provided by the platform (listed in the table above).
zh_cn: 如果不应用任何属性，则插值器的功能将与平台提供的功能完全相同(在上表中列出)。

source: If you don't need to send broadcasts across apps, use local broadcasts.
zh_cn: 如果不需要跨应用程序发送广播，请使用本地广播。

source: If you don't need to send broadcasts to components outside of your app, then send and receive local broadcasts with the LocalBroadcastManager which is available in the Support Library.
zh_cn: 如果不需要向应用程序外部的组件发送广播，则使用 支持库 中提供的 LocalBroadcastManager 发送和接收本地广播。

source: If you don't want to create a completely customized component, but instead are looking to put together a reusable component that consists of a group of existing controls, then creating a Compound Component (or Compound Control) might fit the bill.
zh_cn: 如果你不想创建完全自定义的组件，而是想创建一个由一组已存在的控件组成的可复用的组件，那么创建一个组合组件(或组合控件)可以满足你的需求。

source: If you fail to call this method from an overridden onMeasure() method, the result will be an exception at measurement time.
zh_cn: 如果你在重写 onMeasure() 方法时没有成功调用该方法，在测量时这个结果将会出错。

source: If you have a complex UI, consider writing a custom ViewGroup to perform its layout.
zh_cn: 如果你有复杂的 UI，请考虑编写自定义 ViewGroup 来执行其布局。

source: If you haven't done so already, import the NotePad sample into Android Studio (or just look at the source using the link provided).
zh_cn: 如果你还没看过这个 demo，可以导入 Android Studio (或者用提供的链接看下源代码。)。

source: If you instead want the view to stretch its size to meet the constraints, switch the size to "match constraints".
zh_cn: 如果你想拉伸 view 的尺寸以满足约束， switch the size to "match constraints"。

source: If you instead want the view to stretch its size to meet the constraints, switch the size to "match constraints"; or if you want to keep the current size but move the view so that it is not centered, adjust the constraint bias.
zh_cn: 如果你想拉伸 view 的尺寸以满足约束， switch the size to "match constraints"；或者如果你想保留当前的大小，但想移动 view 使其不居中，adjust the constraint bias。

source: If you need finer control over your view's layout parameters, implement onMeasure().
zh_cn: 如果需要更好地控制 view 的布局参数，请实现 onMeasure()。

source: If you need to perform long running work, be careful about spawning threads or starting background services because the system can kill the entire process after onReceive() returns.
zh_cn: 如果需要执行长时间运行的工作，请小心生成线程或启动后台服务，因为系统可能会在 onReceive() 返回后终止整个进程。

source: If you omit this call, the View class throws a runtime exception.
zh_cn: 如果省略此调用，View 类将引发运行时异常。

source: If you only need to make small adjustments to an existing widget or layout, you can simply subclass the widget or layout and override its methods.
zh_cn: 如果你只需要对现有的 widget 或 layout 作小的调整，你可以简单地创建它们的子类并重写相关方法。

source: If you only want to process a few gestures, you can extend GestureDetector.SimpleOnGestureListener instead of implementing the GestureDetector.OnGestureListener interface.
zh_cn: 如果你只想处理几个手势，可以继承 GestureDetector.SimpleOnGestureListener，而不是实现 GestureDetector.OnGestureListener 界面。

source: If you press the button and select something from the list, it populates the EditText field, but the user can also type something directly into the EditText if they prefer.
zh_cn: 如果你按下按钮并从列表中选择了某项，它会填充 EditText，但是如果用户想要，也可以直接在 EditText 中输入。

source: If you register a receiver in onResume(), you should unregister it in onPause() to prevent registering it multiple times (If you don't want to receive broadcasts when paused, and this can cut down on unnecessary system overhead).
zh_cn: 如果在 onResume() 中注册接收器，则应在 onPause() 中注销接收器，以防止多次注册(如果你不希望在暂停时接收广播，这可以减少不必要的系统开销)。

source: If you register with the Application context, you receive broadcasts as long as the app is running.
zh_cn: 如果你使用应用程序上下文注册，则只要应用程序在运行，就可以接收广播。

source: If you return false from onDown(), as GestureDetector.SimpleOnGestureListener does, the system assumes that you want to ignore the rest of the gesture, and the other methods of GestureDetector.OnGestureListener never get called.
zh_cn: 如果从 onDown() 返回 false，像 GestureDetector.SimpleOnGestureListener 一样，则系统假定你要忽略手势的其余部分，并且永远不会调用 GestureDetector.OnGestureListener 的其他方法。

source: If you specify a permission parameter when registering a broadcast receiver (either with registerReceiver(BroadcastReceiver, IntentFilter, String, Handler) or in <receiver> tag in your manifest), then only broadcasters who have requested the permission with the <uses-permission> tag in their manifest (and subsequently been granted the permission if it is dangerous) can send an Intent to the receiver.
zh_cn: 如果在注册广播接收器时指定了权限参数(使用 registerReceiver(BroadcastReceiver, IntentFilter, String, Handler) 或在清单中的 <receiver> 标记中)。然后，只有在清单中使用 <uses-permission> 标记请求权限(如果是权限危险，则需要随后被授予该权限)的广播者才能向接收器发送 intent。

source: If you want to play the animation immediately, without requiring interaction, then you might want to call it from the onStart() method in your Activity, which will get called when Android makes the view visible on screen.
zh_cn: 如果你希望立即播放动画，而不需要交互，那么你可能希望从 Activity 中的 onStart() 方法调用它，当 Android 使视图在屏幕上可见时，将调用该方法。

source: If you want to use 3D graphics, you must extend SurfaceView instead of View, and draw from a separate thread.
zh_cn: 如果你想要使用 3D 图形，你必须继承 SurfaceView 而不是 View，并从一个独立的线程画图。

source: If you'd like more information about the Layout Editor itself, see the Android Studio guide to Build a UI with Layout Editor.
zh_cn: 如果你想了解有关布局编辑器本身的更多信息，请参阅 Android Studio 指南 Build a UI with Layout Editor。

source: If you're familiar with layout_weight in a linear layout, this works the same way.
zh_cn: 如果你熟悉 linear layout 中的 layout_weight 它们的工作方式是相同的。

source: If you're not satisfied with the interpolators provided by the platform (listed in the table above), you can create a custom interpolator resource with modified attributes.
zh_cn: 如果你对平台提供的插值器(在上表中列出)不满意，可以使用修改的属性创建自定义插值器资源。

source: If you're using AndroidX, add the following dependency:
zh_cn: 如果你使用 AndroidX，添加以下的依赖：

source: If your app runs well on ART, then it should work on Dalvik as well, but the reverse may not be true.
zh_cn: 如果你的应用程序在 ART 上运行良好，那么它也应该在 Dalvik 上运行，但是 反过来可能不正确。

source: If your app targets Android 8.0 or higher, you cannot use the manifest to declare a receiver for most implicit broadcasts (broadcasts that don't target your app specifically).
zh_cn: 如果你的应用程序以 Android 8.0 或更高版本为目标，则无法使用清单为大多数隐式广播(不是专门针对您的应用程序的广播)声明接收器。

source: If your application UI repeats certain layout constructs in multiple places, this lesson shows you how to create efficient, re-usable layout constructs, then include them in the appropriate UI layouts.
zh_cn: 如果应用程序 UI 在多个位置重复某些布局构造，本课程将向你展示如何创建高效、可重用的布局构造，然后将它们包含在相应的 UI 布局中。

source: If your custom View component is not defined as an inner class, then you can, alternatively, declare the View component with the XML element name, and exclude the class attribute.
zh_cn: 如果你的自定义 View 组件没有定义为内部类，你也可以用 XML 的元素名字来申明 View 组件，而不需要 class 属性。

source: If your view class is an inner class, you must further qualify it with the name of the view's outer class.
zh_cn: 如果你的 view 类是内部类，则必须使用 view 人外部类的名称进一步限定它。

source: If your view doesn't need special control over its size, you only need to override one method: onSizeChanged().
zh_cn: 如果你的 view 不需要对其大小进行特殊控制，则只需重写一个方法：onSizeChanged()。

source: Improving Layout Performance
zh_cn: 提高布局性能

source: In Android 4.0 and higher, you can specify a package with setPackage(String) when sending a broadcast.
zh_cn: 在 Android 4.0 及更高版本中，你可以在发送广播时使用 setPackage(String) 指定 package。

source: In Android, there are actually two other Views readily available to do this: Spinner and AutoCompleteTextView, but regardless, the concept of a Combo Box makes an easy-to-understand example.
zh_cn: 在安卓中，事实上有 2 个 View 真的可以这样做，Spinner 和 AutoCompleteTextView 但不管怎样，Combo Box 的概念让这个例子更好理解。

source: In Figure 1, the interpolated fraction is always the same as the elapsed fraction.
zh_cn: 在图 1 中，插值分数始终与经过分数相同。

source: In a normally behaving system, these are the only processes involved in memory management: a well running system will have multiple cached processes always available (for more efficient switching between applications) and regularly kill the oldest ones as needed.
zh_cn: 在正常运行的系统中，这些进程是内存管理所涉及的唯一进程：运行良好的系统将始终有多个缓存进程可用(以便在应用程序之间进行更有效的切换)，并根据需要定期杀死最旧的进程。

source: In a nutshell, this brings together a number of more atomic controls (or views) into a logical group of items that can be treated as a single thing.
zh_cn: 简而言之，它把更多的原子的控件(或 view)组合在成一个有逻辑的项目组，你可以把它单独的东西来对待。

source: In addition to being a well-designed class, though, a custom view should:
zh_cn: 除了是一个精心设计的类之外，自定义视图应该：

source: In addition to describing transitions between layouts, MotionLayout lets you animate any layout properties, as well.
zh_cn: 除了描述布局之间的转换，MotionLayout 还允许设置任何布局属性的动画。

source: In addition to making onDraw() leaner, also make sure it's called as infrequently as possible.
zh_cn: 除了使 onDraw() 更精简之外，还要确保尽可能不频繁地调用它。

source: In addition to position and bounds, the following attributes are interpolated by MotionLayout:
zh_cn: 除了位置和范围，下面的属性是由 MotionLayout 插值：

source: In addition to the attributes in the example above, MotionLayout has other attributes that you might want to specify:
zh_cn: 除了上面示例中的属性之外，MotionLayout 还有其他属性，你可能需要指定这些属性：

source: In addition, if your app is installed on a device running Android 9 or higher, system broadcasts from Wi-Fi don't contain SSIDs, BSSIDs, connection information, or scan results.
zh_cn: 此外，如果应用程序安装在运行 Android9 或更高版本的设备上，则 Wi-Fi 的系统广播不包含 SSID、BSSID、连接信息或扫描结果。

source: In figure 1, the layout looks good in the editor, but there's no vertical constraint on view C. When this layout draws on a device, view C horizontally aligns with the left and right edges of view A, but appears at the top of the screen because it has no vertical constraint.
zh_cn: 在图 1，在布局编辑器上看起来不错，但是在 view C 上没有垂直约束。当这个布局在设备上绘制的时候，view C 与 view A 的左边缘和右边缘水平对齐，但它会出现在屏幕的顶部，因为它没有垂直约束。

source: In figure 11, the first line of B is aligned with the text in A.
zh_cn: 在图 11，B 的第一行与 A 中的文本对齐。

source: In figure 7, the left side of the view is connected to the left edge of the parent layout.
zh_cn: 在图 7，view 的左侧连接到父布局的左边缘。

source: In figure 8, B is constrained to always be to the right of A, and C is constrained below A. However, these constraints do not imply alignment, so B can still move up and down.
zh_cn: 在图 8，B 被约束为总是在 A 的右边，并且 C 被约束在 A 的下面。然而，这些约束并不意味着对齐，所以 B 仍然可以上下移动。

source: In figure 9, the left side of B is aligned to the left side of A. If you want to align the view centers, create a constraint on both sides.
zh_cn: 在图 9，B 的左侧与 A 的左侧对齐。如果你要对齐 view 的中心，请在两侧分别创建约束。

source: In most cases, every Android application runs in its own Linux process.
zh_cn: 在大多数情况下，每一个 Android 应用程序在自己的 Linux 进程中运行。

source: In most cases, you can use scheduled jobs instead.
zh_cn: 在大多数情况下，你可以使用 scheduled jobs 代替。

source: In order to avoid having to repeat the long namespace URI, the sample uses an xmlns directive.
zh_cn: 为了避免必须重复长命名空间 URI，该示例使用 xmlns 指令。
